---
kind: other
id: Methods.T:Autodesk.Revit.DB.Control
source: html/e5faf232-0bc2-a988-2d6d-ee6c2f8b7e33.htm
---
# Control Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.